huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
M480.menu.cpu.m484_64G=GENERIC_M484SG(LQP64)(256kFLASH 96kRAM)
M480.menu.cpu.m484_64G.build.extra_flags=-DCHIP64P -DM484S
M480.menu.cpu.m484_64G.build.series=M480
M480.menu.cpu.m484_64G.build.variant=M480
M480.menu.cpu.m484_64G.build.board=GENERIC_M484S
M480.menu.cpu.m484_64G.build.ldscript=256K_96K_flash.ld
M480.menu.cpu.m484_64G.upload.maximum_size=262144
M480.menu.cpu.m484_64G.upload.maximum_data_size=98304

M480.menu.clock_source.HIRC192=HIRC(192MHz)
M480.menu.clock_source.HIRC192.build.f_cpu=192000000L -DHIRC
M480.menu.clock_source.HXT192=HXT_12M(192MMHz)
M480.menu.clock_source.HXT192.build.f_cpu=192000000L -DHXT12

M480.menu.serial.UART0=Serial0(PF_2/3)
M480.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M480.menu.serial.UART1=Serial1(PB_2/3)
M480.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M480.menu.serial.UART2=Serial2(PB_0/1)
M480.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
M480.menu.serial.UART3=Serial3(PB_14/15)
M480.menu.serial.UART3.build.extra_flags_serial=-DMENU_SERIAL=Serial3
M480.menu.serial.UART4=Serial4(PA_2/3))
M480.menu.serial.UART4.build.extra_flags_serial=-DMENU_SERIAL=Serial4
M480.menu.serial.UART5=Serial5(PB_4/5)
M480.menu.serial.UART5.build.extra_flags_serial=-DMENU_SERIAL=Serial5
M480.menu.serial.NuICE=Nulink console
M480.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
M480.menu.log.default=Release(no-exceptions)
M480.menu.log.default.build.log_level=-fno-exceptions
M480.menu.log.Release=Release(exceptions)
M480.menu.log.fatal=FATAL
M480.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
M480.menu.log.error=ERROR
M480.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
M480.menu.log.warning=WARNING
M480.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
M480.menu.log.info=INFO
M480.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
M480.menu.log.debug=DEBUG
M480.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
M480.menu.log.trace=TRACE
M480.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

M480.upload.tool=nulinkburn
M480.upload.protocol=nuc-ba
M480.upload.use_1200bps_touch=false
M480.upload.wait_for_upload_port=false
M480.upload.native_usb=false

################################################################################################
#                                   Nuvoton-M451                                               #
################################################################################################
M451.name=NuTiny_M451(256kFLASH 32kRAM)
M451.build.vid=0x2341
M451.build.pid=0x003e

M451.build.core=nuvoton
M451.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
M451.build.f_cpu=72000000L

M451.build.series=M451Series
M451.build.variant=M451
M451.build.board=NuTiny_M451
M451.build.extra_flags=-D__M451__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
M451.build.ldscript=256K_32K_flash.ld
M451.upload.maximum_size=262144
M451.upload.maximum_data_size=32768

M451.menu.serial.UART0=Serial0
M451.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M451.menu.serial.UART1=Serial1
M451.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M451.menu.serial.UART2=Serial
M451.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
M451.menu.serial.UART3=Serial3
M451.menu.serial.UART3.build.extra_flags_serial=-DMENU_SERIAL=Serial3
M451.menu.serial.NuICE=Nulink console
M451.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
M451.menu.log.default=Release(no-exceptions)
M451.menu.log.default.build.log_level=-fno-exceptions
M451.menu.log.Release=Release(exceptions)
M451.menu.log.fatal=FATAL
M451.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
M451.menu.log.error=ERROR
M451.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
M451.menu.log.warning=WARNING
M451.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
M451.menu.log.info=INFO
M451.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
M451.menu.log.debug=DEBUG
M451.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
M451.menu.log.trace=TRACE
M451.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

M451.upload.tool=nulinkburn
M451.upload.protocol=nuc-ba
M451.upload.use_1200bps_touch=false
M451.upload.wait_for_upload_port=false
M451.upload.native_usb=false

################################################################################################
#                                   Nuvoton-M240                                               #
################################################################################################
NUC200.name=NuEdu_NUC240(128kFLASH 16kRAM) 
NUC200.build.vid=0x2341
NUC200.build.pid=0x003e

NUC200.build.core=nuvoton
NUC200.build.mcu=cortex-m0
NUC200.build.f_cpu=48000000L

NUC200.build.series=NUC200Series
NUC200.build.variant=NUC240
NUC200.build.board=NuEdu_NUC240
NUC200.build.extra_flags=-D__NUC240__ -DCHIP100P -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NUC200.build.ldscript=128K_16K_flash.ld
NUC200.upload.maximum_size=131072
NUC200.upload.maximum_data_size=16384

NUC200.menu.serial.UART0=Serial0
NUC200.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC200.menu.serial.UART1=Serial1
NUC200.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NUC200.menu.serial.UART2=Serial2
NUC200.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
NUC200.menu.serial.NuICE=Nulink console
NUC200.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC200.menu.log.default=Release(no-exceptions)
NUC200.menu.log.default.build.log_level=-fno-exceptions
NUC200.menu.log.Release=Release(exceptions)
NUC200.menu.log.fatal=FATAL
NUC200.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NUC200.menu.log.error=ERROR
NUC200.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NUC200.menu.log.warning=WARNING
NUC200.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NUC200.menu.log.info=INFO
NUC200.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NUC200.menu.log.debug=DEBUG
NUC200.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NUC200.menu.log.trace=TRACE
NUC200.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

