huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
NUC200.upload.tool=nulinkburn
NUC200.upload.protocol=sam-ba
NUC200.upload.use_1200bps_touch=false
NUC200.upload.wait_for_upload_port=false
NUC200.upload.native_usb=false


############################################### NuEdu-Uno ##########################################
NUC131.name=NuEdu-Uno(NUC131) 
NUC131.build.vid=0x2341
NUC131.build.pid=0x003e

NUC131.build.core=nuvoton
NUC131.build.mcu=cortex-m0
NUC131.build.f_cpu=50000000L

NUC131.build.series=NUC131
NUC131.build.board=NuEdu_NUC131
NUC131.build.variant=NUC131_UNO
NUC131.build.extra_flags=-D__NUC131__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NUC131.build.ldscript=64K_8K_flash.ld
NUC131.upload.maximum_size=65536
NUC131.upload.maximum_data_size=8192

NUC131.menu.serial.UART0=Serial0
NUC131.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
#NUC131.menu.serial.UART1=Serial1
#NUC131.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO131.menu.serial.NuICE=Nulink console
NANO131.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC131.menu.log.default=Release(no-exceptions)
NUC131.menu.log.default.build.log_level=-fno-exceptions
NUC131.menu.log.Release=Release(exceptions)
NUC131.menu.log.fatal=FATAL
NUC131.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NUC131.menu.log.error=ERROR
NUC131.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NUC131.menu.log.warning=WARNING
NUC131.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NUC131.menu.log.info=INFO
NUC131.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NUC131.menu.log.debug=DEBUG
NUC131.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NUC131.menu.log.trace=TRACE
NUC131.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

NUC131.upload.tool=nulinkburn
NUC131.upload.protocol=nuc-ba
NUC131.upload.use_1200bps_touch=false
NUC131.upload.wait_for_upload_port=false
NUC131.upload.native_usb=false

############################################### NuMaker_NANO100 ##########################################
NANO130.name=NANO130
NANO130.build.vid=0x2341
NANO130.build.pid=0x003e

NANO130.build.core=nuvoton
NANO130.build.mcu=cortex-m0
NANO130.build.f_cpu=42000000L
NANO130.build.variant=NANO130
NANO130.build.board=NuEdu_NANO130

NANO130.menu.cpu.NuEdu=NuEdu-EVB_NANO130(128kFLASH 16kRAM)

NANO130.menu.cpu.NuTiny=NuTiny_EVB_NANO130(128kFLASH 16kRAM)
NANO130.menu.cpu.NuTiny.build.board=NuTiny_NANO130

NANO130.build.series=Nano100Series
NANO130.build.extra_flags=-D__NANO100__ -DCHIP128P -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NANO130.build.ldscript=128K_16K_flash.ld
NANO130.upload.maximum_size=131072
NANO130.upload.maximum_data_size=16384

NANO130.menu.clock_source.HXT12=HXT
NANO130.menu.clock_source.HXT12.build.f_cpu=42000000L -DHXT12
NANO130.menu.clock_source.HIRC=HIRC
NANO130.menu.clock_source.HIRC.build.f_cpu=42000000L -DHIRC

NANO130.menu.serial.UART0=Serial0
NANO130.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NANO130.menu.serial.UART1=Serial1
NANO130.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO130.menu.serial.NuICE=Nulink console
NANO130.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NANO130.menu.log.default=Release(no-exceptions)
NANO130.menu.log.default.build.log_level=-fno-exceptions
NANO130.menu.log.Release=Release(exceptions)
NANO130.menu.log.fatal=FATAL
NANO130.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NANO130.menu.log.error=ERROR
NANO130.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NANO130.menu.log.warning=WARNING
NANO130.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NANO130.menu.log.info=INFO
NANO130.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NANO130.menu.log.debug=DEBUG
NANO130.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NANO130.menu.log.trace=TRACE
NANO130.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

NANO130.upload.tool=nulinkburn
NANO130.upload.protocol=nuc-ba
NANO130.upload.use_1200bps_touch=false
NANO130.upload.wait_for_upload_port=false
NANO130.upload.native_usb=false

############################################### NuEdu-NANO120 ##########################################
NANO120.name=NANO120
NANO120.build.vid=0x2341
NANO120.build.pid=0x003e

NANO120.build.core=nuvoton
NANO120.build.mcu=cortex-m0
NANO120.build.f_cpu=42000000L
NANO120.build.variant=Nano120
NANO120.build.board=NANO120
NANO120.build.series=Nano100Series
NANO120.build.extra_flags=-D__NANO100__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON

NANO120.menu.cpu.nano120ke3=NuTiny_EVB(NANO120KE3 128kFLASH 16kRAM)
NANO120.menu.cpu.nano120ke3.build.ldscript=128K_16K_flash.ld
NANO120.menu.cpu.nano120ke3.upload.maximum_size=125952
NANO120.menu.cpu.nano120ke3.upload.maximum_data_size=16384

NANO120.menu.cpu.nano120ke2=GENERIC_NANO120KE2 (64kFLASH 8kRAM)
NANO120.menu.cpu.nano120ke2.build.ldscript=64K_8K_flash.ld
NANO120.menu.cpu.nano120ke2.upload.maximum_size=65536
NANO120.menu.cpu.nano120ke2.upload.maximum_data_size=8192

NANO120.menu.clock_source.HXT12=HXT
NANO120.menu.clock_source.HXT12.build.osc=HXT12
NANO120.menu.clock_source.HIRC=HIRC
NANO120.menu.clock_source.HIRC.build.osc=HIRC

NANO120.menu.cpu_speed.f48=48M
NANO120.menu.cpu_speed.f48.build.f_cpu=48000000L -D{build.osc}
NANO120.menu.cpu_speed.f32=32M
NANO120.menu.cpu_speed.f32.build.f_cpu=32000000L -D{build.osc}
NANO120.menu.cpu_speed.f24=24M
NANO120.menu.cpu_speed.f24.build.f_cpu=24000000L -D{build.osc}

NANO120.menu.serial.UART0=Serial0
NANO120.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NANO120.menu.serial.UART1=Serial1
NANO120.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO120.menu.serial.NuICE=Nulink console
NANO120.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

