huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NANO120.menu.log.default=Release(no-exceptions)
NANO120.menu.log.default.build.log_level=-fno-exceptions
NANO120.menu.log.Release=Release(exceptions)
NANO120.menu.log.fatal=FATAL
NANO120.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NANO120.menu.log.error=ERROR
NANO120.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NANO120.menu.log.warning=WARNING
NANO120.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NANO120.menu.log.info=INFO
NANO120.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NANO120.menu.log.debug=DEBUG
NANO120.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NANO120.menu.log.trace=TRACE
NANO120.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

NANO120.upload.tool=nulinkburn
NANO120.upload.protocol=nuc-ba
NANO120.upload.use_1200bps_touch=false
NANO120.upload.wait_for_upload_port=false
NANO120.upload.native_usb=false


############################################### NuMaker-TRIO ##########################################
NANO1x2.name=NANO1X2
NANO1x2.build.vid=0x2341
NANO1x2.build.pid=0x003e

NANO1x2.build.core=nuvoton
NANO1x2.build.mcu=cortex-m0
NANO1x2.build.f_cpu=32000000L
NANO1x2.build.variant=NANO102ZC2_TRIO
NANO1x2.build.board=NANO102
NANO1x2.build.series=Nano1X2Series

NANO1x2.menu.cpu.numake_trio=NuMaker_TRIO(NANO102ZC2 32kFLASH 8kRAM)
NANO1x2.menu.cpu.numake_trio.build.extra_flags=-D__NANO1X2__ -D__NANO102ZC2AN__ -D__IOT_EVB__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NANO1x2.menu.cpu.numake_trio.build.ldscript=32K_8K_flash.ld
NANO1x2.menu.cpu.numake_trio.upload.maximum_size=32768
NANO1x2.menu.cpu.numake_trio.upload.maximum_data_size=8192

NANO1x2.menu.serial.UART0=Serial0
NANO1x2.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NANO1x2.menu.serial.UART1=Serial1
NANO1x2.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO1x2.menu.serial.NuICE=Nulink console
NANO1x2.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NANO1x2.menu.log.default=Release(no-exceptions)
NANO1x2.menu.log.default.build.log_level=-fno-exceptions
NANO1x2.menu.log.Release=Release(exceptions)
NANO1x2.menu.log.fatal=FATAL
NANO1x2.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NANO1x2.menu.log.error=ERROR
NANO1x2.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NANO1x2.menu.log.warning=WARNING
NANO1x2.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NANO1x2.menu.log.info=INFO
NANO1x2.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NANO1x2.menu.log.debug=DEBUG
NANO1x2.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NANO1x2.menu.log.trace=TRACE
NANO1x2.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

NANO1x2.upload.use_1200bps_touch=false
NANO1x2.upload.wait_for_upload_port=false
NANO1x2.upload.tool=nulinkburn
NANO1x2.upload.protocol=nuc-ba
NANO1x2.upload.native_usb=false


############################################### NANO102S ##########################################
#nuvoton_nano102s.name=NANO102S
#nuvoton_nano102s.build.vid=0x2341
#nuvoton_nano102s.build.pid=0x003e

#nuvoton_nano102s.build.core=nuvoton
#nuvoton_nano102s.build.mcu=cortex-m0
#nuvoton_nano102s.build.variant=NANO1X2
#nuvoton_nano102s.build.f_cpu=32000000L
#nuvoton_nano102s.build.extra_flags=-D__NANO1X2__ -D__NANO102ZC2AN__ -D__IOT_EVB__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
#nuvoton_nano102s.build.board=nuvoton
#nuvoton_nano102s.build.ldscript=32K_8K_flash.ld
#nuvoton_nano102s.build.series=Nano1X2Series
#nuvoton_nano102s.upload.maximum_size=32768

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
#nuvoton_nano102s.menu.log.default=Release(no-exceptions)
#nuvoton_nano102s.menu.log.default.build.log_level=-fno-exceptions
#nuvoton_nano102s.menu.log.Release=Release(exceptions)
#nuvoton_nano102s.menu.log.fatal=FATAL
#nuvoton_nano102s.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
#nuvoton_nano102s.menu.log.error=ERROR
#nuvoton_nano102s.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
#nuvoton_nano102s.menu.log.warning=WARNING
#nuvoton_nano102s.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
#nuvoton_nano102s.menu.log.info=INFO
#nuvoton_nano102s.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
#nuvoton_nano102s.menu.log.debug=DEBUG
#nuvoton_nano102s.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
#nuvoton_nano102s.menu.log.trace=TRACE
#nuvoton_nano102s.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

#nuvoton_nano102s.upload.tool=nulinkburn
#nuvoton_nano102s.upload.protocol=nuc-ba
#nuvoton_nano102s.upload.wait_for_upload_port=false
#nuvoton_nano102s.upload.use_1200bps_touch=false
#nuvoton_nano102s.upload.native_usb=false

########################################################
#                  nuvoton m05x                       #
########################################################
M05x.name=M051(16/8/4/2)

M05x.build.core=nuvoton
M05x.build.mcu=cortex-m0
M05x.build.f_cpu=22118400L
M05x.build.variant=M0516
M05x.build.board=M0516

M05x.menu.cpu.m0516_48=GENERIC_M0516L(LQP48)(64kFLASH 4kRAM)
M05x.menu.cpu.m0516_48.build.extra_flags=-DCHIP48P -DM0516L
M05x.menu.cpu.m0516_48.build.series=M051Series
M05x.menu.cpu.m0516_48.build.variant=M051
M05x.menu.cpu.m0516_48.build.board=M0516L
M05x.menu.cpu.m0516_48.build.ldscript=64K_4K_flash.ld
M05x.menu.cpu.m0516_48.upload.maximum_size=65536
M05x.menu.cpu.m0516_48.upload.maximum_data_size=4096

M05x.menu.cpu.m0516_33=GENERIC_M0516Z(QFN33) (64kFLASH 4kRAM)
M05x.menu.cpu.m0516_33.build.extra_flags=-DCHIP33P -DM0516Z
M05x.menu.cpu.m0516_33.build.series=M051Series
M05x.menu.cpu.m0516_33.build.variant=M051
M05x.menu.cpu.m0516_33.build.board=GENERIC_M0516Z
M05x.menu.cpu.m0516_33.build.ldscript=64K_4K_flash.ld
M05x.menu.cpu.m0516_33.upload.maximum_size=65536
M05x.menu.cpu.m0516_33.upload.maximum_data_size=4096

M05x.menu.cpu.m058_48=GENERIC_M058L(LQP48)  (32kFLASH 4kRAM)
M05x.menu.cpu.m058_48.build.extra_flags=-DCHIP48P -DM058L
M05x.menu.cpu.m058_48.build.series=M058S
M05x.menu.cpu.m058_48.build.variant=M058S
M05x.menu.cpu.m058_48.build.board=GENERIC_M058L
M05x.menu.cpu.m058_48.build.ldscript=32K_4K_flash.ld
M05x.menu.cpu.m058_48.upload.maximum_size=32768
M05x.menu.cpu.m058_48.upload.maximum_data_size=4096

