huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
MINI58.menu.log.default=Release(no-exceptions)
MINI58.menu.log.default.build.log_level=-fno-exceptions
MINI58.menu.log.Release=Release(exceptions)
MINI58.menu.log.fatal=FATAL
MINI58.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
MINI58.menu.log.error=ERROR
MINI58.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
MINI58.menu.log.warning=WARNING
MINI58.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
MINI58.menu.log.info=INFO
MINI58.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
MINI58.menu.log.debug=DEBUG
MINI58.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
MINI58.menu.log.trace=TRACE
MINI58.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

MINI58.upload.tool=nulinkburn
MINI58.upload.protocol=nuc-ba
MINI58.upload.use_1200bps_touch=false
MINI58.upload.wait_for_upload_port=false
MINI58.upload.native_usb=false


########################################################
#                  nuvoton mini5X                      #
########################################################
MINI5x.name=Mini51(4/2)

MINI5x.build.core=nuvoton
MINI5x.build.mcu=cortex-m0
MINI5x.build.f_cpu=22118400L
MINI5x.build.variant=MINI58
MINI5x.build.board=GENERIC_MINI58FDE

MINI5x.menu.cpu.MINI54_48=GENERIC_MINI54L(LQP48)  (16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54_48.build.extra_flags=-DCHIP48P -DMINI54L
MINI5x.menu.cpu.MINI54_48.build.variant=MINI51
MINI5x.menu.cpu.MINI54_48.build.board=GENERIC_MINI54L
MINI5x.menu.cpu.MINI54_48.build.series=Mini51Series
MINI5x.menu.cpu.MINI54_48.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54_48.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54_48.upload.maximum_data_size=4096

MINI5x.menu.cpu.MINI54_33=GENERIC_MINI54T/Z(QEN33)(16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54_33.build.extra_flags=-DCHIP33P -DMINI54TZ
MINI5x.menu.cpu.MINI54_33.build.variant=MINI51
MINI5x.menu.cpu.MINI54_33.build.board=GENERIC_MINI54TZ
MINI5x.menu.cpu.MINI54_33.build.series=Mini51Series
MINI5x.menu.cpu.MINI54_33.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54_33.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54_33.upload.maximum_data_size=4096

MINI5x.menu.cpu.MINI54_20=GENERIC_MINI54F(TSSOP20)(16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54_20.build.extra_flags=-DCHIP20P -DMINI54F
MINI5x.menu.cpu.MINI54_20.build.variant=MINI51
MINI5x.menu.cpu.MINI54_20.build.board=GENERIC_MINI54F
MINI5x.menu.cpu.MINI54_20.build.series=Mini51Series
MINI5x.menu.cpu.MINI54_20.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54_20.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54_20.upload.maximum_data_size=4096

#MINI5x.menu.cpu.MINI52_48=GENERIC_MINI52L(LQP48)   (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52_48.build.extra_flags=-DCHIP48P -DMINI52L
#MINI5x.menu.cpu.MINI52_48.build.variant=MINI51
#MINI5x.menu.cpu.MINI52_48.build.board=GENERIC_MINI52L
#MINI5x.menu.cpu.MINI52_48.build.series=Mini51Series
#MINI5x.menu.cpu.MINI52_48.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52_48.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52_48.upload.maximum_data_size=2048

#MINI5x.menu.cpu.MINI52_33=GENERIC_MINI52T/Z(QEN33) (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52_33.build.extra_flags=-DCHIP33P -DMINI52TZ
#MINI5x.menu.cpu.MINI52_33.build.variant=MINI51
#MINI5x.menu.cpu.MINI52_33.build.board=GENERIC_MINI52TZ
#MINI5x.menu.cpu.MINI52_33.build.series=Mini51Series
#MINI5x.menu.cpu.MINI52_33.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52_33.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52_33.upload.maximum_data_size=2048

#MINI5x.menu.cpu.MINI52_20=GENERIC_MINI52F(TSSOP20) (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52_20.build.extra_flags=-DCHIP20P -DMINI52F
#MINI5x.menu.cpu.MINI52_20.build.variant=MINI51
#MINI5x.menu.cpu.MINI52_20.build.board=GENERIC_MINI52F
#MINI5x.menu.cpu.MINI52_20.build.series=Mini51Series
#MINI5x.menu.cpu.MINI52_20.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52_20.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52_20.upload.maximum_data_size=2048

MINI5x.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
MINI5x.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
MINI5x.menu.clock_source.HXT125=HXT_12M(50MMHz)
MINI5x.menu.clock_source.HXT125.build.f_cpu=50000000L -DHXT12
#MINI5x.menu.clock_source.HXT1210=HXT_12M(100MMHz)
#MINI5x.menu.clock_source.HXT1210.build.f_cpu=100000000L -DHXT12

MINI5x.menu.serial.UART0=Serial0(P1_2/3)
MINI5x.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
MINI5x.menu.serial.NuICE=Nulink console
MINI5x.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
MINI5x.menu.log.default=Release(no-exceptions)
MINI5x.menu.log.default.build.log_level=-fno-exceptions
MINI5x.menu.log.Release=Release(exceptions)
MINI5x.menu.log.fatal=FATAL
MINI5x.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
MINI5x.menu.log.error=ERROR
MINI5x.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
MINI5x.menu.log.warning=WARNING
MINI5x.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
MINI5x.menu.log.info=INFO
MINI5x.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
MINI5x.menu.log.debug=DEBUG
MINI5x.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
MINI5x.menu.log.trace=TRACE
MINI5x.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

MINI5x.upload.tool=nulinkburn
MINI5x.upload.protocol=nuc-ba
MINI5x.upload.use_1200bps_touch=false
MINI5x.upload.wait_for_upload_port=false
MINI5x.upload.native_usb=false

########################################################
#                      NUC029                          #
########################################################
NUC029FAE.name=NUC029

NUC029FAE.build.core=nuvoton
NUC029FAE.build.mcu=cortex-m0
NUC029FAE.build.f_cpu=22118400L
NUC029FAE.build.variant=NUC029
NUC029FAE.build.board=GENERIC_NUC029

NUC029FAE.menu.cpu.m058_20=GENERIC_NUC029FAE(TSSOP20)(16kFLASH 2kRAM)
NUC029FAE.menu.cpu.m058_20.build.extra_flags=-DCHIP20P
NUC029FAE.menu.cpu.m058_20.build.series=NUC029FAE
NUC029FAE.menu.cpu.m058_20.build.variant=NUC029
NUC029FAE.menu.cpu.m058_20.build.board=GENERIC_NUC029FAE
NUC029FAE.menu.cpu.m058_20.build.ldscript=16K_2K_flash_S.ld
NUC029FAE.menu.cpu.m058_20.upload.maximum_size=16384
NUC029FAE.menu.cpu.m058_20.upload.maximum_data_size=2048

NUC029FAE.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
NUC029FAE.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
NUC029FAE.menu.clock_source.HXT1=HXT_12M(48MMHz)
NUC029FAE.menu.clock_source.HXT1.build.f_cpu=48000000L -DHXT12
NUC029FAE.menu.clock_source.HXT2=HXT_12M(24MMHz)
NUC029FAE.menu.clock_source.HXT2.build.f_cpu=24000000L -DHXT12

NUC029FAE.menu.serial.UART0=Serial0(P1_2/3)
NUC029FAE.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029FAE.menu.serial.NuICE=Nulink console
NUC029FAE.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC029FAE.menu.log.default=Release(no-exceptions)
NUC029FAE.menu.log.default.build.log_level=-fno-exceptions
NUC029FAE.menu.log.Release=Release(exceptions)
NUC029FAE.menu.log.fatal=FATAL
NUC029FAE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NUC029FAE.menu.log.error=ERROR
NUC029FAE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NUC029FAE.menu.log.warning=WARNING
NUC029FAE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NUC029FAE.menu.log.info=INFO
NUC029FAE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NUC029FAE.menu.log.debug=DEBUG
NUC029FAE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NUC029FAE.menu.log.trace=TRACE
NUC029FAE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

NUC029FAE.upload.tool=nulinkburn
NUC029FAE.upload.protocol=nuc-ba
NUC029FAE.upload.use_1200bps_touch=false
NUC029FAE.upload.wait_for_upload_port=false
NUC029FAE.upload.native_usb=false

############################################### The end ##########################################
